---
kind: property
id: P:Autodesk.Revit.DB.FabricationAncillaryUsage.Length
zh: 长度
source: html/2fea1615-56df-d26c-6bef-c073ff8157c5.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.Length Property

**中文**: 长度

Length of required ancillaries.

## Syntax (C#)
```csharp
public double Length { get; }
```